## Duración 00:23:38

### Crear un DataFrame

In [1]:
import pandas as pd

In [2]:
datos = { 'Nombre' : ['Juan', 'Romina', 'Lucas', 'Cristian', 'Damian', 'Javier'],
         'Calificaciones': ['100', '99', '98', '97', '96', '95'],
         'Deportes': ['Futbol', 'Voley', 'Basquet', 'Futbol','Futbol', 'Futbol'],
         'Materias': ['Calculo', 'Lenguas', 'Historia', 'Dibujo', 'Musica', 'Programación'] }

In [3]:
print(datos)

{'Nombre': ['Juan', 'Romina', 'Lucas', 'Cristian', 'Damian', 'Javier'], 'Calificaciones': ['100', '99', '98', '97', '96', '95'], 'Deportes': ['Futbol', 'Voley', 'Basquet', 'Futbol', 'Futbol', 'Futbol'], 'Materias': ['Calculo', 'Lenguas', 'Historia', 'Dibujo', 'Musica', 'Programación']}

In [4]:
df = pd.DataFrame(datos)

In [5]:
df

     Nombre Calificaciones Deportes      Materias
0      Juan            100   Futbol       Calculo
1    Romina             99    Voley       Lenguas
2     Lucas             98  Basquet      Historia
3  Cristian             97   Futbol        Dibujo
4    Damian             96   Futbol        Musica
5    Javier             95   Futbol  Programación

In [6]:
df.head(1)

  Nombre Calificaciones Deportes Materias
0   Juan            100   Futbol  Calculo

### DataFrame manipulado para hacer modificaciones

In [7]:
import numpy as np

In [8]:
datosManipulados = { 'Nombre' : ['Juan', 'Romina', 'Lucas', 'Cristian', 'Damian', 'N/A'],
         'Calificaciones': ['100', '99', '98', np.nan, '96', '95'],
         'Deportes': ['Futbol', 'Voley', 'Basquet', 'Futbol','N/A', 'Futbol'],
         'Materias': ['Calculo', 'Lenguas', 'N/A', 'Dibujo', 'Musica', 'Programación'] }

In [9]:
dfManipulados = pd.DataFrame(datosManipulados)

In [10]:
dfManipulados

     Nombre Calificaciones Deportes      Materias
0      Juan            100   Futbol       Calculo
1    Romina             99    Voley       Lenguas
2     Lucas             98  Basquet           N/A
3  Cristian            NaN   Futbol        Dibujo
4    Damian             96      N/A        Musica
5       N/A             95   Futbol  Programación

In [11]:
dfManipulados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Nombre            6 non-null object
Calificaciones    5 non-null object
Deportes          6 non-null object
Materias          6 non-null object
dtypes: object(4)
memory usage: 136.0+ bytes

### Estadísticas

In [12]:
dfManipulados.describe()

       Nombre Calificaciones Deportes Materias
count       6              5        6        6
unique      6              5        4        6
top       N/A             98   Futbol  Lenguas
freq        1              1        3        1

In [13]:
dfSinNan = pd.DataFrame(dfManipulados)

In [14]:
dfSinNan = dfSinNan.replace(np.nan, '0')

In [15]:
print(dfSinNan)

     Nombre Calificaciones Deportes      Materias
0      Juan            100   Futbol       Calculo
1    Romina             99    Voley       Lenguas
2     Lucas             98  Basquet           N/A
3  Cristian              0   Futbol        Dibujo
4    Damian             96      N/A        Musica
5       N/A             95   Futbol  Programación

#### Eliminan nan

In [16]:
dfEliminarNan = pd.DataFrame(dfManipulados)

In [17]:
dfEliminarNan.dropna(how='any', inplace= True)

In [18]:
print(dfEliminarNan)
### Se elimina a Cristian porque tiene un nan en calificaciones

   Nombre Calificaciones Deportes      Materias
0    Juan            100   Futbol       Calculo
1  Romina             99    Voley       Lenguas
2   Lucas             98  Basquet           N/A
4  Damian             96      N/A        Musica
5     N/A             95   Futbol  Programación

### Eliminar registro buscando por columna

In [19]:
dfEliminarPorColumna = pd.DataFrame(dfManipulados)

In [20]:
dfEliminarPorColumna = dfEliminarPorColumna[dfEliminarPorColumna['Nombre'] != 'N/A']

In [21]:
dfEliminarPorColumna

     Nombre Calificaciones Deportes Materias
0      Juan            100   Futbol  Calculo
1    Romina             99    Voley  Lenguas
2     Lucas             98  Basquet      N/A
3  Cristian            NaN   Futbol   Dibujo
4    Damian             96      N/A   Musica

### Cambiar a cero cualquier valor NaN en el df

In [22]:
dfNanCero = pd.DataFrame(dfManipulados)

In [23]:
dfNanCero.fillna(0, inplace=True)

In [24]:
dfNanCero

     Nombre Calificaciones Deportes      Materias
0      Juan            100   Futbol       Calculo
1    Romina             99    Voley       Lenguas
2     Lucas             98  Basquet           N/A
3  Cristian              0   Futbol        Dibujo
4    Damian             96      N/A        Musica
5       N/A             95   Futbol  Programación

In [25]:
dfNanCero.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Nombre            6 non-null object
Calificaciones    6 non-null object
Deportes          6 non-null object
Materias          6 non-null object
dtypes: object(4)
memory usage: 136.0+ bytes

In [26]:
dfNanCero.describe()

       Nombre Calificaciones Deportes Materias
count       6              6        6        6
unique      6              6        4        6
top       N/A             98   Futbol  Lenguas
freq        1              1        3        1

### Convertir a numeros enteros

In [27]:
dfNumerosEnteros = pd.DataFrame(dfManipulados)

In [28]:
dfNumerosEnteros['Calificaciones'] = dfNumerosEnteros.Calificaciones.astype(int)

In [29]:
dfNumerosEnteros.describe()

       Calificaciones
count        6.000000
mean        81.333333
std         39.888177
min          0.000000
25%         95.250000
50%         97.000000
75%         98.750000
max        100.000000

In [30]:
dfNumerosEnteros.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Nombre            6 non-null object
Calificaciones    6 non-null int32
Deportes          6 non-null object
Materias          6 non-null object
dtypes: int32(1), object(3)
memory usage: 136.0+ bytes

### Estadisticas individuales

In [31]:
### Solo el promedio
print('Promedio: ', dfNumerosEnteros['Calificaciones'].mean())

Promedio:  81.33333333333333

In [32]:
### Solo el maximo
print('Maximo: ', dfNumerosEnteros['Calificaciones'].max())

Maximo:  100